# ===========================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 🚀
#
# This source code is under MIT License 📜
# ❌ Unauthorized forking, importing, or using this code
#    without giving proper credit will result in legal action ⚠️
#
# 📩 DM for permission : @TheSigmaCoder
# ===========================================================


HELP_1 = """<b><u>𝐀꯭ᴅ꯭ᴍ꯭ɪ꯭ɴ ꯭༭꯭ 𝐂꯭ᴏ꯭ᴍ꯭ᴍ꯭ᴀ꯭ɴ꯭ᴅ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

❖ 𝐉꯭ᴜ꯭s꯭ᴛ ᴀ꯭ᴅ꯭ᴅ <b>ᴄ</b> ɪɴ ᴛʜᴇ sᴛᴀʀᴛɪɴɢ ᴏғ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ᴛᴏ ᴜsᴇ ᴛʜᴇᴍ ғᴏʀ ᴄʜᴀɴɴᴇʟ.

𝐏꯭ᴀ꯭ᴜ꯭s꯭ᴇ ꯭༭꯭ <b>/pause</b> : ᴘᴀᴜsᴇ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ sᴛʀᴇᴀᴍ.

𝐑꯭ᴇ꯭s꯭ᴜ꯭ᴍ꯭ᴇ ꯭༭꯭ <b>/resume</b> : ʀᴇsᴜᴍᴇ ᴛʜᴇ ᴘᴀᴜsᴇᴅ sᴛʀᴇᴀᴍ.

𝐒꯭ᴋ꯭ɪ꯭ᴘ ꯭༭꯭ <b>/skip</b> : sᴋɪᴘ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ sᴛʀᴇᴀᴍ ᴀɴᴅ sᴛᴀʀᴛ ᴛʜᴇ ɴᴇxᴛ ᴛʀᴀᴄᴋ.

𝐄꯭ɴ꯭ᴅ ꯭༭꯭ <b>/end</b> ᴏʀ <b>/stop</b> : ᴄʟᴇᴀʀs ᴛʜᴇ ǫᴜᴇᴜᴇ ᴀɴᴅ ᴇɴᴅs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ sᴛʀᴇᴀᴍ.

𝐐꯭ᴜ꯭ᴇ꯭ᴜ꯭ᴇ ꯭༭꯭ <b>/queue</b> : sʜᴏᴡs ᴛʜᴇ ǫᴜᴇᴜᴇᴅ ᴛʀᴀᴄᴋs.

𝐋꯭ᴏ꯭ᴏ꯭ᴘ ꯭༭꯭ <b>/loop</b> : ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ʟᴏᴏᴘ ᴘʟᴀʏʙᴀᴄᴋ.

𝐒꯭ʜ꯭ᴜ꯭ғ꯭ғ꯭ʟ꯭ᴇ ꯭༭꯭ <b>/shuffle</b> : sʜᴜғғʟᴇ ᴛʜᴇ ǫᴜᴇᴜᴇᴅ ᴛʀᴀᴄᴋs.

𝐒꯭ᴇ꯭ᴇ꯭ᴋ ꯭༭꯭ <b>/seek</b> : sᴇᴇᴋ ᴛʜᴇ sᴛʀᴇᴀᴍ ᴛᴏ ᴛʜᴇ ɢɪᴠᴇɴ ᴅᴜʀᴀᴛɪᴏɴ.

𝐒꯭ᴇ꯭ᴇ꯭ᴋ 𝐁꯭ᴀ꯭ᴄ꯭ᴋ ꯭༭꯭ <b>/seekback</b> : sᴇᴇᴋ ʙᴀᴄᴋᴡᴀʀᴅ ᴛᴏ ᴛʜᴇ ɢɪᴠᴇɴ ᴅᴜʀᴀᴛɪᴏɴ.

𝐒꯭ᴘ꯭ᴇ꯭ᴇ꯭ᴅ ꯭༭꯭ <b>/speed</b> ᴏʀ <b>/playback</b> : ᴀᴅᴊᴜsᴛ ᴛʜᴇ ᴀᴜᴅɪᴏ ᴘʟᴀʏʙᴀᴄᴋ sᴘᴇᴇᴅ.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_2 = """<b><u>𝐀꯭ᴜ꯭ᴛ꯭ʜ ꯭༭꯭ 𝐔꯭s꯭ᴇ꯭ʀ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

❖ 𝐀꯭ᴜ꯭ᴛ꯭ʜ ᴜsᴇʀs ᴄᴀɴ ᴜsᴇ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ɪɴ ᴛʜᴇ ʙᴏᴛ ᴡɪᴛʜᴏᴜᴛ ᴀᴅᴍɪɴ ʀɪɢʜᴛs ɪɴ ᴛʜᴇ ᴄʜᴀᴛ.

𝐀꯭ᴜ꯭ᴛ꯭ʜ ꯭༭꯭ <b>/auth [ᴜsᴇʀɴᴀᴍᴇ/ᴜsᴇʀ_ɪᴅ]</b> : ᴀᴅᴅ ᴀ ᴜsᴇʀ ᴛᴏ ᴛʜᴇ ᴀᴜᴛʜ ʟɪsᴛ.

𝐔꯭ɴ꯭ᴀ꯭ᴜ꯭ᴛ꯭ʜ ꯭༭꯭ <b>/unauth [ᴜsᴇʀɴᴀᴍᴇ/ᴜsᴇʀ_ɪᴅ]</b> : ʀᴇᴍᴏᴠᴇ ᴀɴ ᴀᴜᴛʜ ᴜsᴇʀ.

𝐀꯭ᴜ꯭ᴛ꯭ʜ 𝐔꯭s꯭ᴇ꯭ʀ꯭s ꯭༭꯭ <b>/authusers</b> : sʜᴏᴡs ᴛʜᴇ ʟɪsᴛ ᴏғ ᴀᴜᴛʜ ᴜsᴇʀs.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_3 = """<b><u>𝐁꯭ʀ꯭ᴏ꯭ᴀ꯭ᴅ꯭ᴄ꯭ᴀ꯭s꯭ᴛ ꯭༭꯭ 𝐅꯭ᴇ꯭ᴀ꯭ᴛ꯭ᴜ꯭ʀ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

[ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

𝐁꯭ʀ꯭ᴏ꯭ᴀ꯭ᴅ꯭ᴄ꯭ᴀ꯭s꯭ᴛ ꯭༭꯭ <b>/broadcast</b> : ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ sᴇʀᴠᴇᴅ ᴄʜᴀᴛs.

<b><u>𝐁꯭ʀ꯭ᴏ꯭ᴀ꯭ᴅ꯭ᴄ꯭ᴀ꯭s꯭ᴛ꯭ɪ꯭ɴ꯭ɢ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ꯭s</u></b>

𝐏꯭ɪ꯭ɴ ꯭༭꯭ <b>-pin</b> : ᴘɪɴs ᴛʜᴇ ʙʀᴏᴀᴅᴄᴀsᴛᴇᴅ ᴍᴇssᴀɢᴇ.

𝐏꯭ɪ꯭ɴ 𝐋꯭ᴏ꯭ᴜ꯭ᴅ ꯭༭꯭ <b>-pinloud</b> : ᴘɪɴs ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴀɴᴅ sᴇɴᴅs ɴᴏᴛɪғɪᴄᴀᴛɪᴏɴ.

𝐔꯭s꯭ᴇ꯭ʀ ꯭༭꯭ <b>-user</b> : sᴇɴᴅs ᴛʜᴇ ᴍᴇssᴀɢᴇ ᴛᴏ ʙᴏᴛ ᴜsᴇʀs.

𝐀꯭ss꯭ɪ꯭s꯭ᴛ꯭ᴀ꯭ɴ꯭ᴛ ꯭༭꯭ <b>-assistant</b> : sᴇɴᴅs ᴛʜᴇ ᴍᴇssᴀɢᴇ ғʀᴏᴍ ᴀssɪsᴛᴀɴᴛ.

𝐍꯭ᴏ 𝐁꯭ᴏ꯭ᴛ ꯭༭꯭ <b>-nobot</b> : sᴋɪᴘs ʙᴏᴛ ʙʀᴏᴀᴅᴄᴀsᴛ.

<b>𝐄꯭x꯭ᴀ꯭ᴍ꯭ᴘ꯭ʟ꯭ᴇ ꯭༭꯭</b>
<code>/broadcast -user -assistant -pin testing broadcast</code>

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_4 = """<b><u>𝐁꯭ʟ꯭ᴀ꯭ᴄ꯭ᴋ꯭ʟ꯭ɪ꯭s꯭ᴛ ꯭༭꯭ 𝐅꯭ᴇ꯭ᴀ꯭ᴛ꯭ᴜ꯭ʀ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

[ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

𝐁꯭ʟ꯭ᴀ꯭ᴄ꯭ᴋ꯭ʟ꯭ɪ꯭s꯭ᴛ ꯭༭꯭ <b>/blacklistchat [ᴄʜᴀᴛ ɪᴅ]</b> : ʙʟᴀᴄᴋʟɪsᴛ ᴀ ᴄʜᴀᴛ.

𝐖꯭ʜ꯭ɪ꯭ᴛ꯭ᴇ꯭ʟ꯭ɪ꯭s꯭ᴛ ꯭༭꯭ <b>/whitelistchat [ᴄʜᴀᴛ ɪᴅ]</b> : ᴡʜɪᴛᴇʟɪsᴛ ᴛʜᴇ ᴄʜᴀᴛ.

𝐁꯭ʟ꯭ᴀ꯭ᴄ꯭ᴋ꯭ʟ꯭ɪ꯭s꯭ᴛ꯭ᴇ꯭ᴅ ꯭༭꯭ <b>/blacklistedchat</b> : sʜᴏᴡs ʙʟᴀᴄᴋʟɪsᴛᴇᴅ ᴄʜᴀᴛs.

<b><u>𝐁꯭ʟ꯭ᴏ꯭ᴄ꯭ᴋ ꯭༭꯭ 𝐔꯭s꯭ᴇ꯭ʀ꯭s</u></b>

𝐁꯭ʟ꯭ᴏ꯭ᴄ꯭ᴋ ꯭༭꯭ <b>/block [ᴜsᴇʀɴᴀᴍᴇ]</b> : ʙʟᴏᴄᴋ ᴛʜᴇ ᴜsᴇʀ.

𝐔꯭ɴ꯭ʙ꯭ʟ꯭ᴏ꯭ᴄ꯭ᴋ ꯭༭꯭ <b>/unblock [ᴜsᴇʀɴᴀᴍᴇ]</b> : ᴜɴʙʟᴏᴄᴋ ᴛʜᴇ ᴜsᴇʀ.

𝐁꯭ʟ꯭ᴏ꯭ᴄ꯭ᴋ꯭ᴇ꯭ᴅ ꯭༭꯭ <b>/blockedusers</b> : sʜᴏᴡs ʙʟᴏᴄᴋᴇᴅ ᴜsᴇʀs.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_5 = """<b><u>𝐏꯭ʟ꯭ᴀ꯭ʏ ꯭༭꯭ 𝐂꯭ᴏ꯭ᴍ꯭ᴍ꯭ᴀ꯭ɴ꯭ᴅ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

𝐕꯭ɪ꯭ᴅ꯭ᴇ꯭ᴏ ꯭༭꯭ <b>v</b> : sᴛᴀɴᴅs ғᴏʀ ᴠɪᴅᴇᴏ ᴘʟᴀʏ.

𝐅꯭ᴏ꯭ʀ꯭ᴄ꯭ᴇ ꯭༭꯭ <b>force</b> : sᴛᴀɴᴅs ғᴏʀ ғᴏʀᴄᴇ ᴘʟᴀʏ.

𝐏꯭ʟ꯭ᴀ꯭ʏ ꯭༭꯭ <b>/play</b> ᴏʀ <b>/vplay</b> : sᴛᴀʀᴛs sᴛʀᴇᴀᴍɪɴɢ ᴛʜᴇ ʀᴇǫᴜᴇsᴛᴇᴅ ᴛʀᴀᴄᴋ.

𝐏꯭ʟ꯭ᴀ꯭ʏ 𝐅꯭ᴏ꯭ʀ꯭ᴄ꯭ᴇ ꯭༭꯭ <b>/playforce</b> ᴏʀ <b>/vplayforce</b> : sᴛᴏᴘs ᴛʜᴇ ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ ᴀɴᴅ sᴛᴀʀᴛs ᴛʜᴇ ɴᴇᴡ ᴛʀᴀᴄᴋ.

<b><u>𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ ꯭༭꯭ 𝐏꯭ʟ꯭ᴀ꯭ʏ ꯭༭꯭ 𝐂꯭ᴏ꯭ᴍ꯭ᴍ꯭ᴀ꯭ɴ꯭ᴅ꯭s</u></b>

𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ 𝐏꯭ʟ꯭ᴀ꯭ʏ ꯭༭꯭ <b>/cplay</b> : sᴛᴀʀᴛs ᴀᴜᴅɪᴏ sᴛʀᴇᴀᴍɪɴɢ.

𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ 𝐕꯭ɪ꯭ᴅ꯭ᴇ꯭ᴏ ꯭༭꯭ <b>/cvplay</b> : sᴛᴀʀᴛs ᴠɪᴅᴇᴏ sᴛʀᴇᴀᴍɪɴɢ.

𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ 𝐏꯭ʟ꯭ᴀ꯭ʏ 𝐅꯭ᴏ꯭ʀ꯭ᴄ꯭ᴇ ꯭༭꯭ <b>/cplayforce</b> ᴏʀ <b>/cvplayforce</b> : sᴛᴏᴘs ᴏɴɢᴏɪɴɢ sᴛʀᴇᴀᴍ.

<b>𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ 𝐏꯭ʟ꯭ᴀ꯭ʏ ꯭༭꯭ <b>/channelplay</b></b> : ᴄᴏɴɴᴇᴄᴛs ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴀ ɢʀᴏᴜᴘ.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_6 = """<b><u>𝐆꯭ʟ꯭ᴏ꯭ʙ꯭ᴀ꯭ʟ ꯭༭꯭ 𝐁꯭ᴀ꯭ɴ ꯭༭꯭ 𝐅꯭ᴇ꯭ᴀ꯭ᴛ꯭ᴜ꯭ʀ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

[ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

𝐆꯭ʟ꯭ᴏ꯭ʙ꯭ᴀ꯭ʟ 𝐁꯭ᴀ꯭ɴ ꯭༭꯭ <b>/gban [ᴜsᴇʀɴᴀᴍᴇ]</b> : ɢʟᴏʙᴀʟʟʏ ʙᴀɴs ᴛʜᴇ ᴜsᴇʀ.

𝐔꯭ɴ꯭ɢ꯭ʙ꯭ᴀ꯭ɴ ꯭༭꯭ <b>/ungban [ᴜsᴇʀɴᴀᴍᴇ]</b> : ɢʟᴏʙᴀʟʟʏ ᴜɴʙᴀɴs ᴛʜᴇ ᴜsᴇʀ.

𝐆꯭ʙ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ᴅ ꯭༭꯭ <b>/gbannedusers</b> : sʜᴏᴡs ɢʟᴏʙᴀʟʟʏ ʙᴀɴɴᴇᴅ ᴜsᴇʀs.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/annu_updates">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_7 = """<b><u>𝐀꯭ᴄ꯭ᴛ꯭ɪ꯭ᴠ꯭ᴇ ꯭༭꯭ 𝐕꯭ɪ꯭ᴅ꯭ᴇ꯭ᴏ꯭ᴄ꯭ʜ꯭ᴀ꯭ᴛ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

[ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

𝐀꯭ᴄ꯭ᴛ꯭ɪ꯭ᴠ꯭ᴇ 𝐕꯭ᴏ꯭ɪ꯭ᴄ꯭ᴇ ꯭༭꯭ <b>/activevoice</b> : sʜᴏᴡs ᴀᴄᴛɪᴠᴇ ᴠᴏɪᴄᴇᴄʜᴀᴛs.

𝐀꯭ᴄ꯭ᴛ꯭ɪ꯭ᴠ꯭ᴇ 𝐕꯭ɪ꯭ᴅ꯭ᴇ꯭ᴏ ꯭༭꯭ <b>/activevideo</b> : sʜᴏᴡs ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏᴄʜᴀᴛs.

𝐀꯭ᴄ ꯭༭꯭ <b>/ac</b> : sʜᴏᴡs ʙᴏᴛʜ ᴠᴏɪᴄᴇ ᴀɴᴅ ᴠɪᴅᴇᴏ ᴄʜᴀᴛs.

𝐀꯭ᴜ꯭ᴛ꯭ᴏ 𝐄꯭ɴ꯭ᴅ ꯭༭꯭ <b>/autoend [ᴇɴᴀʙʟᴇ|ᴅɪsᴀʙʟᴇ]</b> : ᴇɴᴅs sᴛʀᴇᴀᴍ ᴡʜᴇɴ ɴᴏ ᴏɴᴇ ɪs ʟɪsᴛᴇɴɪɴɢ.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/annu_updates">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_8 = """<b><u>𝐌꯭ᴀ꯭ɪ꯭ɴ꯭ᴛ꯭ᴇ꯭ɴ꯭ᴀ꯭ɴ꯭ᴄ꯭ᴇ ꯭༭꯭ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

[ᴏɴʟʏ ғᴏʀ sᴜᴅᴏᴇʀs]

𝐋꯭ᴏ꯭ɢ꯭s ꯭༭꯭ <b>/logs</b> : ɢᴇᴛ ʟᴏɢs ᴏғ ᴛʜᴇ ʙᴏᴛ.

𝐋꯭ᴏ꯭ɢ꯭ɢ꯭ᴇ꯭ʀ ꯭༭꯭ <b>/logger [ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ]</b> : ᴄᴏɴᴛʀᴏʟ ʙᴏᴛ ʟᴏɢɢɪɴɢ.

𝐌꯭ᴀ꯭ɪ꯭ɴ꯭ᴛ꯭ᴇ꯭ɴ꯭ᴀ꯭ɴ꯭ᴄ꯭ᴇ ꯭༭꯭ <b>/maintenance [ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ]</b> : ᴄᴏɴᴛʀᴏʟ ᴍᴀɪɴᴛᴇɴᴀɴᴄᴇ ᴍᴏᴅᴇ.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_9 = """<b><u>𝐁꯭ᴀ꯭s꯭ɪ꯭ᴄ ꯭༭꯭ 𝐂꯭ᴏ꯭ᴍ꯭ᴍ꯭ᴀ꯭ɴ꯭ᴅ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

𝐒꯭ᴛ꯭ᴀ꯭ʀ꯭ᴛ ꯭༭꯭ <b>/start</b> : sᴛᴀʀᴛs ᴛʜᴇ ᴍᴜsɪᴄ ʙᴏᴛ.

𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ <b>/help</b> : ᴏᴘᴇɴs ᴛʜᴇ ʜᴇʟᴘ ᴍᴇɴᴜ.

𝐏꯭ɪ꯭ɴ꯭ɢ ꯭༭꯭ <b>/ping</b> : sʜᴏᴡs ᴘɪɴɢ ᴀɴᴅ sʏsᴛᴇᴍ sᴛᴀᴛs.

𝐑꯭ᴇ꯭ʙ꯭ᴏ꯭ᴏ꯭ᴛ ꯭༭꯭ <b>/reboot</b> : ʀᴇʙᴏᴏᴛs ᴛʜᴇ ʙᴏᴛ.

𝐒꯭ᴇ꯭ᴛ꯭ᴛ꯭ɪ꯭ɴ꯭ɢ꯭s ꯭༭꯭ <b>/settings</b> : sʜᴏᴡs ɢʀᴏᴜᴘ sᴇᴛᴛɪɴɢs.

𝐏꯭ʀ꯭ɪ꯭ᴠ꯭ᴀ꯭ᴄ꯭ʏ ꯭༭꯭ <b>/privacy</b> : sʜᴏᴡs ʙᴏᴛ ᴘʀɪᴠᴀᴄʏ.

𝐒꯭ᴜ꯭ᴅ꯭ᴏ 𝐋꯭ɪ꯭s꯭ᴛ ꯭༭꯭ <b>/sudolist</b> : sʜᴏᴡs sᴜᴅᴏ ᴜsᴇʀs.

𝐑꯭ᴇ꯭s꯭ᴛ꯭ᴀ꯭ʀ꯭ᴛ ꯭༭꯭ <b>/restart</b> : ʀᴇsᴛᴀʀᴛs ᴛʜᴇ ʙᴏᴛ.

𝐒꯭ᴛ꯭ᴀ꯭ᴛ꯭s ꯭༭꯭ <b>/stats</b> : sʜᴏᴡs ᴏᴠᴇʀᴀʟʟ sᴛᴀᴛs.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_10 = """<b><u>𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ ғᴏʀ 𝐖꯭ᴇ꯭ʟ꯭ᴄ꯭ᴏ꯭ᴍ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

❖ 𝐖꯭ᴇ꯭ʟ꯭ᴄ꯭ᴏ꯭ᴍ꯭ᴇ ꯭༭꯭ <b>/welcome</b> : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ғᴏʀ ᴡᴇʟᴄᴏᴍᴇ.

<i>» 𝐍꯭ᴏ꯭ᴛ꯭ᴇ : ᴡᴇʟᴄᴏᴍᴇ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇs ɪɴ 5 ᴍɪɴᴜᴛᴇs.</i>
"""


HELP_11 = """<b><u>𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ ғᴏʀ 𝐋꯭ᴏ꯭ᴄ꯭ᴋ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

🔒 <b>𝐀꯭ᴅ꯭ᴠ꯭ᴀ꯭ɴ꯭ᴄ꯭ᴇ꯭ᴅ 𝐋꯭ᴏ꯭ᴄ꯭ᴋ 𝐒꯭ʏ꯭s꯭ᴛ꯭ᴇ꯭ᴍ</b>

• <b>/lock [type]</b> — ᴇɴᴀʙʟᴇ ᴀ ʟᴏᴄᴋ ᴛʏᴘᴇ.
• <b>/unlock [type]</b> — ᴅɪsᴀʙʟᴇ ᴀ ʟᴏᴄᴋ ᴛʏᴘᴇ.
• <b>/unlockall</b> — ʀᴇᴍᴏᴠᴇ ᴀʟʟ ʟᴏᴄᴋs.
• <b>/locks</b> — ᴏᴘᴇɴ ᴛʜᴇ ʟᴏᴄᴋ ᴍᴇɴᴜ.
• <b>/lockadmin [on/off]</b> — ᴀᴘᴘʟʏ ʟᴏᴄᴋs ᴛᴏ ᴀᴅᴍɪɴs.
• <b>/locktypes</b> — sʜᴏᴡ ᴀʟʟ ʟᴏᴄᴋ ᴛʏᴘᴇs.

<i>⚡ ᴘᴇʀᴍɪssɪᴏɴ ʀᴇǫᴜɪʀᴇᴅ : ᴄᴀɴ_ᴄʜᴀɴɢᴇ_ɪɴꜰᴏ</i>

🟢 <b>𝐀꯭ᴘ꯭ᴘ꯭ʀ꯭ᴏ꯭ᴠ꯭ᴇ꯭ᴅ 𝐔꯭s꯭ᴇ꯭ʀ꯭s</b>

• <b>/approve</b> — ᴀᴘᴘʀᴏᴠᴇ ᴀ ᴜsᴇʀ.
• <b>/unapprove</b> — ʀᴇᴍᴏᴠᴇ ᴀᴘᴘʀᴏᴠᴀʟ.
• <b>/approvedusers</b> — sʜᴏᴡ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs.
• <b>/allunapprove</b> — ʀᴇᴍᴏᴠᴇ ᴀʟʟ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs.

⚡ <i>ᴏɴʟʏ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴs ᴄᴀɴ ᴀᴘᴘʀᴏᴠᴇ/ᴜɴᴀᴘᴘʀᴏᴠᴇ.</i>

⚠️ <b>𝐀꯭ᴜ꯭ᴛ꯭ᴏ 𝐖꯭ᴀ꯭ʀ꯭ɴ 𝐒꯭ʏ꯭s꯭ᴛ꯭ᴇ꯭ᴍ</b>

• <b>/lockwarns</b> — ᴄʜᴇᴄᴋ ᴜsᴇʀ ʟᴏᴄᴋ ᴡᴀʀɴɪɴɢs.
• <b>/clearwarns</b> — ᴄʟᴇᴀʀ ᴀʟʟ ᴡᴀʀɴɪɴɢs.

🔸 3 ᴡᴀʀɴɪɴɢs = ᴀᴜᴛᴏ ʙᴀɴ

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/annu_updates">𝐀꯭ɴ꯭ɴ꯭ᴜ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


HELP_12 = """<b><u>𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ ғᴏʀ 𝐍꯭ɪ꯭ɢ꯭ʜ꯭ᴛ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭</u></b>

❖ 𝐍꯭ɪ꯭ɢ꯭ʜ꯭ᴛ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ ꯭༭꯭ <b>/nightmode</b> : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ғᴏʀ ɴɪɢʜᴛ ᴍᴏᴅᴇ.

<b>𝐏꯭ᴏ꯭ᴡ꯭ᴇ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐁꯭ʏ</b> <a href="https://t.me/kirti_bots">𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ ꯭𝐁꯭ᴏ꯭ᴛ꯭s</a>
"""


# ===========================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 😎
#
# 🧑‍💻 Developer : t.me/TheSigmaCoder
# 🔗 Source link : GitHub.com/Im-Notcoder/Shivi-V2
# 📢 Telegram channel : t.me/Purvi_Bots
# ===========================================================
