# ===========================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 🚀
#
# This source code is under MIT License 📜
# ❌ Unauthorized forking, importing, or using this code
#    without giving proper credit will result in legal action ⚠️
#
# 📩 DM for permission : @TheSigmaCoder
# ===========================================================


class Helper(object):

    HELP_ABOUT = '''
**𝐓꯭ʜ꯭ɪ꯭s ꯭༭꯭ 𝐈꯭s ꯭༭꯭ <u>{0}</u>
─────────────────────────
❖ 𝐀꯭ 𝐌꯭ᴜ꯭s꯭ɪ꯭ᴄ ꯭༭꯭ 𝐁꯭ᴏ꯭ᴛ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐓꯭ᴇ꯭ʟ꯭ᴇ꯭ɢ꯭ʀ꯭ᴀ꯭ᴍ ꯭༭꯭ 𝐆꯭ʀ꯭ᴏ꯭ᴜ꯭ᴘ꯭s ꯭༭꯭ / 𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ꯭s
─────────────────────────
● 𝐖꯭ʀ꯭ɪ꯭ᴛ꯭ᴛ꯭ᴇ꯭ɴ ꯭༭꯭ 𝐈꯭ɴ ꯭༭꯭ ➥ [𝐏꯭ʏ꯭ᴛ꯭ʜ꯭ᴏ꯭ɴ](https://www.python.org/)
● 𝐃꯭ᴀ꯭ᴛ꯭ᴀ꯭ʙ꯭ᴀ꯭s꯭ᴇ ꯭༭꯭ ➥ [𝐌꯭ᴏ꯭ɴ꯭ɢ꯭ᴏ꯭-𝐃꯭𝐁](https://www.mongodb.com/)
● 𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ 𝐖꯭ɪ꯭ᴛ꯭ʜ [𝐏꯭ʏ꯭ʀ꯭ᴏ꯭ɢ꯭ʀ꯭ᴀ꯭ᴍ](https://github.com/pyrogram/pyrogram) & [𝐏꯭ʏ꯭-𝐓꯭ɢ꯭ᴄ꯭ᴀ꯭ʟ꯭ʟ꯭s](https://github.com/pytgcalls/pytgcalls).
─────────────────────────
✦ 𝐍꯭ᴏ ꯭༭꯭ 𝐋꯭ᴀ꯭ɢ • 𝐍꯭ᴏ ꯭༭꯭ 𝐀꯭ᴅ꯭s • 𝐍꯭ᴏ ꯭༭꯭ 𝐁꯭ᴜ꯭ɢ꯭s • 24/7 𝐒꯭ᴜ꯭ᴘ꯭ᴘ꯭ᴏ꯭ʀ꯭ᴛ
✦ 𝐄꯭ɴ꯭ᴊ꯭ᴏ꯭ʏ ꯭༭꯭ 𝐋꯭ᴀ꯭ɢ ꯭༭꯭ 𝐅꯭ʀ꯭ᴇ꯭ᴇ ꯭༭꯭ 𝐌꯭ᴜ꯭s꯭ɪ꯭ᴄ • 𝐀꯭ᴅ꯭ᴅ ꯭༭꯭ 𝐌꯭ᴇ ꯭༭꯭ 𝐍꯭ᴏ꯭ᴡ
─────────────────────────
» 𝐏꯭ʀ꯭ɪ꯭ᴠ꯭ᴀ꯭ᴛ꯭ᴇ ꯭༭꯭ & 𝐒꯭ᴇ꯭ᴄ꯭ᴜ꯭ʀ꯭ᴇ ꯭༭꯭ 𝐒꯭ᴏ꯭ᴜ꯭ʀ꯭ᴄ꯭ᴇ | 𝐍꯭ᴏ ꯭༭꯭ 𝐃꯭ᴀ꯭ᴛ꯭ᴀ ꯭༭꯭ 𝐒꯭ʜ꯭ᴀ꯭ʀ꯭ᴇ
» 𝐋꯭ɪ꯭ᴄ꯭ᴇ꯭ɴ꯭ᴄ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐔꯭s꯭ᴇ | 𝐘꯭ᴏ꯭ᴜ꯭ᴛ꯭ᴜ꯭ʙ꯭ᴇ ꯭༭꯭ 𝐀꯭ᴘ꯭ɪ ꯭༭꯭ 𝐒꯭ᴜ꯭ᴘ꯭ᴘ꯭ᴏ꯭ʀ꯭ᴛ꯭ᴇ꯭ᴅ
──────────────────────
➤ 𝐁꯭ᴏ꯭ᴛ ꯭༭꯭ 𝐒꯭ᴛ꯭ᴀ꯭ᴛ꯭ᴜ꯭s ꯭༭꯭ & 𝐌꯭ᴏ꯭ʀ꯭ᴇ ꯭༭꯭ 𝐁꯭ᴏ꯭ᴛ꯭s - [𝐂꯭ʟ꯭ɪ꯭ᴄ꯭ᴋ ꯭༭꯭ 𝐇꯭ᴇ꯭ʀ꯭ᴇ](https://t.me/annu_updates)
➤ 𝐏꯭ᴀ꯭ɪ꯭ᴅ ꯭༭꯭ 𝐏꯭ʀ꯭ᴏ꯭ᴍ꯭ᴏ꯭ᴛ꯭ɪ꯭ᴏ꯭ɴ ꯭༭꯭ :- [𝐂꯭ᴏ꯭ɴ꯭ᴛ꯭ᴀ꯭ᴄ꯭ᴛ ꯭༭꯭ 𝐇꯭ᴇ꯭ʀ꯭ᴇ](https://t.me/Krish_xd_ii)
─────────────────────────**
'''


    HELP_SUPPORT = '''
**❖ <u>𝐒꯭ᴜ꯭ᴘ꯭ᴘ꯭ᴏ꯭ʀ꯭ᴛ ꯭༭꯭ 𝐈꯭ɴ꯭꯭꯭꯭꯭ғ꯭ᴏ</u> :-

● 24/7 𝐀꯭ᴠ꯭ᴀ꯭ɪ꯭ʟ꯭ᴀ꯭ʙ꯭ʟ꯭ᴇ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐀꯭ɴ꯭ʏ ꯭༭꯭ 𝐁꯭ᴏ꯭ᴛ.
● 𝐊꯭ᴇ꯭ᴇ꯭ᴘ ꯭༭꯭ 𝐂꯭ʜ꯭ᴀ꯭ᴛ ꯭༭꯭ 𝐂꯭ʟ꯭ᴇ꯭ᴀ꯭ɴ ꯭༭꯭ 𝐀꯭ɴ꯭ᴅ ꯭༭꯭ 𝐁꯭ᴜ꯭ɢ꯭-𝐅꯭ʀ꯭ᴇ꯭ᴇ.
● 𝐀꯭ɴ꯭ʏ ꯭༭꯭ 𝐏꯭ʀ꯭ᴏ꯭ʙ꯭ʟ꯭ᴇ꯭ᴍ ꯭༭꯭ ? 𝐉꯭ᴜ꯭s꯭ᴛ ꯭༭꯭ 𝐂꯭ᴏ꯭ɴ꯭ᴛ꯭ᴀ꯭ᴄ꯭ᴛ ꯭༭꯭ 𝐔꯭s.
─────────────────────────
❖ 𝐔꯭ᴘ꯭ᴅ꯭ᴀ꯭ᴛ꯭ᴇ꯭s ꯭༭꯭ 𝐂꯭ʜ꯭ᴀ꯭ɴ꯭ɴ꯭ᴇ꯭ʟ ꯭༭꯭ ➥ [𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ-𝐁꯭ᴏ꯭ᴛ꯭s](https://t.me/kirti_bots)
❖ 𝐒꯭ᴜ꯭ᴘ꯭ᴘ꯭ᴏ꯭ʀ꯭ᴛ ꯭༭꯭ 𝐂꯭ʜ꯭ᴀ꯭ᴛ ꯭༭꯭ ➥ [𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ-𝐔꯭ᴘ꯭ᴅ꯭ᴀ꯭ᴛ꯭ᴇ꯭s](https://t.me/kirti_bots_support)
❖ 𝐆꯭ɪ꯭ᴛ ꯭༭꯭ 𝐇꯭ᴜ꯭ʙ ꯭༭꯭ 𝐋꯭ɪ꯭ɴ꯭ᴋ ꯭༭꯭ ➥ [𝐓꯭ᴇ꯭ᴀ꯭ᴍ-𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ](https://github.com/kirtibots)
─────────────────────────**
'''


    HELP_WEL = '''**<u>❖ 𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐖꯭ᴇ꯭ʟ꯭ᴄ꯭ᴏ꯭ᴍ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭ :</u>

❍ /welcome : 𝐈꯭ɴ꯭ʟ꯭ɪ꯭ɴ꯭ᴇ ꯭༭꯭ 𝐂꯭ᴏ꯭ɴ꯭ᴛ꯭ʀ꯭ᴏ꯭ʟ꯭s ꯭༭꯭ 𝐁꯭ᴜ꯭ᴛ꯭ᴛ꯭ᴏ꯭ɴ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐖꯭ᴇ꯭ʟ꯭ᴄ꯭ᴏ꯭ᴍ꯭ᴇ.**

<i>» 𝐍꯭ᴏ꯭ᴛ꯭ᴇ ꯭༭꯭ :- 𝐖꯭ᴇ꯭ʟ꯭ᴄ꯭ᴏ꯭ᴍ꯭ᴇ ꯭༭꯭ 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐃꯭ᴇ꯭ʟ꯭ᴇ꯭ᴛ꯭ᴇ ꯭༭꯭ 𝐈꯭ɴ ꯭༭꯭ 5 𝐌꯭ɪ꯭ɴ꯭ᴜ꯭ᴛ꯭ᴇ꯭s.</i>
'''


    HELP_NIGHT = '''**<u>❖ 𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐍꯭ɪ꯭ɢ꯭ʜ꯭ᴛ ꯭༭꯭ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭ ❖</u>

❍ /nightmode : 𝐈꯭ɴ꯭ʟ꯭ɪ꯭ɴ꯭ᴇ ꯭༭꯭ 𝐂꯭ᴏ꯭ɴ꯭ᴛ꯭ʀ꯭ᴏ꯭ʟ꯭s ꯭༭꯭ 𝐁꯭ᴜ꯭ᴛ꯭ᴛ꯭ᴏ꯭ɴ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐍꯭ɪ꯭ɢ꯭ʜ꯭ᴛ ꯭༭꯭ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ.

❖ 𝐂꯭ʀ꯭ᴇ꯭ᴅ꯭ɪ꯭ᴛ ꯭༭꯭ 𝖡ʏ » [𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ-𝐁꯭ᴏ꯭ᴛ꯭ѕ](https://t.me/kirti_bots)**
'''


    HELP_LOCK = '''
**<u>❖ 𝐇꯭ᴇ꯭ʀ꯭ᴇ ꯭༭꯭ 𝐈꯭s ꯭༭꯭ 𝐇꯭ᴇ꯭ʟ꯭ᴘ ꯭༭꯭ 𝐅꯭ᴏ꯭ʀ ꯭༭꯭ 𝐋꯭ᴏ꯭ᴄ꯭ᴋ꯭s ꯭༭ ꯭𝆺꯭꯭𝅥🥂꯭─꯭̽─꯭ :</u>

🔒 𝐀꯭ᴅ꯭ᴠ꯭ᴀ꯭ɴ꯭ᴄ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐋꯭ᴏ꯭ᴄ꯭ᴋ ꯭༭꯭ 𝐒꯭ʏ꯭s꯭ᴛ꯭ᴇ꯭ᴍ ꯭༭꯭ — 𝐅꯭ᴜ꯭ʟ꯭ʟ ꯭༭꯭ 𝐂꯭ᴏ꯭ɴ꯭ᴛ꯭ʀ꯭ᴏ꯭ʟ

• /lock [type] — 𝐄꯭ɴ꯭ᴀ꯭ʙ꯭ʟ꯭ᴇ ꯭༭꯭ ᴀɴʏ ʟᴏᴄᴋ ᴛʏᴘᴇ
• /unlock [type] — 𝐃꯭ɪ꯭s꯭ᴀ꯭ʙ꯭ʟ꯭ᴇ ꯭༭꯭ sᴘᴇᴄɪ꯭꯭ғɪᴄ ʟᴏᴄᴋ
• /unlockall — 𝐑꯭ᴇ꯭ᴍ꯭ᴏ꯭ᴠ꯭ᴇ ꯭༭꯭ ᴀʟʟ ʟᴏᴄᴋs
• /locks — 𝐎꯭ᴘ꯭ᴇ꯭ɴ ꯭༭꯭ ɪɴʟɪɴᴇ ʟᴏᴄᴋ ᴍᴇɴᴜ
• /lockadmin [on/off] — 𝐋꯭ᴏ꯭ᴄ꯭ᴋ ꯭༭꯭ ᴀᴘᴘʟɪᴇs ᴛᴏ ᴀᴅᴍɪɴs ᴀʟsᴏ
• /locktypes — 𝐕꯭ɪ꯭ᴇ꯭ᴡ ꯭༭꯭ ᴀʟʟ ʟᴏᴄᴋ ᴛʏᴘᴇs ᴡɪᴛʜ ᴅᴇsᴄʀɪᴘᴛɪᴏɴs

<i>⚡ 𝐏꯭ᴇ꯭ʀ꯭ᴍ꯭ɪ꯭ss꯭ɪ꯭ᴏ꯭ɴ ꯭༭꯭ 𝐑꯭ᴇ꯭ǫ꯭ᴜ꯭ɪ꯭ʀ꯭ᴇ꯭ᴅ ꯭༭꯭ : ᴄᴀɴ_ᴄʜᴀɴɢᴇ_ɪɴꜰᴏ</i>

🟢 𝐀꯭ᴘ꯭ᴘ꯭ʀ꯭ᴏ꯭ᴠ꯭ᴇ꯭ᴅ ꯭༭꯭ 𝐔꯭s꯭ᴇ꯭ʀ ꯭༭꯭ 𝐒꯭ʏ꯭s꯭ᴛ꯭ᴇ꯭ᴍ ꯭༭꯭ — 𝐁꯭ʏ꯭ᴘ꯭ᴀ꯭ss ꯭༭꯭ 𝐌꯭ᴏ꯭ᴅ꯭ᴇ

• /approve — 𝐀꯭ᴘ꯭ᴘ꯭ʀ꯭ᴏ꯭ᴠ꯭ᴇ ꯭༭꯭ ᴀ ᴜsᴇʀ
• /unapprove — 𝐑꯭ᴇ꯭ᴍ꯭ᴏ꯭ᴠ꯭ᴇ ꯭༭꯭ ᴀᴘᴘʀᴏᴠᴀʟ
• /approvedusers — 𝐒꯭ʜ꯭ᴏ꯭ᴡ ꯭༭꯭ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs
• /allunapprove — 𝐑꯭ᴇ꯭ᴍ꯭ᴏ꯭ᴠ꯭ᴇ ꯭༭꯭ ᴀʟʟ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs

<i>⚡ 𝐎꯭ɴ꯭ʟ꯭ʏ ꯭༭꯭ 𝐆꯭ʀ꯭ᴏ꯭ᴜ꯭ᴘ ꯭༭꯭ 𝐀꯭ᴅ꯭ᴍ꯭ɪ꯭ɴ꯭s ꯭༭꯭ 𝐂꯭ᴀ꯭ɴ ꯭༭꯭ 𝐀꯭ᴘ꯭ᴘ꯭ʀ꯭ᴏ꯭ᴠ꯭ᴇ/𝐔꯭ɴ꯭ᴀ꯭ᴘ꯭ᴘ꯭ʀ꯭ᴏ꯭ᴠ꯭ᴇ</i>

⚠️ 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐖꯭ᴀ꯭ʀ꯭ɴ ꯭༭꯭ 𝐒꯭ʏ꯭s꯭ᴛ꯭ᴇ꯭ᴍ

• /lockwarns — 𝐂꯭ʜ꯭ᴇ꯭ᴄ꯭ᴋ ꯭༭꯭ ᴀ ᴜsᴇʀ's ʟᴏᴄᴋ ᴡᴀʀɴɪɴɢs
• /clearwarns — 𝐂꯭ʟ꯭ᴇ꯭ᴀ꯭ʀ ꯭༭꯭ ᴀʟʟ ᴡᴀʀɴɪɴɢs ᴏ꯭ғ ᴀ ᴜsᴇʀ

🔸 3 ᴡᴀʀɴɪɴɢs = 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐁꯭ᴀ꯭ɴ
🔸 𝐀꯭ᴅ꯭ᴅ꯭ɪ꯭ɴ꯭ɢ ꯭༭꯭ 𝐁꯭ᴏ꯭ᴛ꯭s ꯭༭꯭ 𝐖꯭ʜ꯭ᴇ꯭ɴ ꯭༭꯭ 𝐋꯭ᴏ꯭ᴄ꯭ᴋ꯭ᴇ꯭ᴅ ꯭༭꯭ = 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐖꯭ᴀ꯭ʀ꯭ɴ + 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐑꯭ᴇ꯭ᴍ꯭ᴏ꯭ᴠ꯭ᴇ + 𝐀꯭ᴜ꯭ᴛ꯭ᴏ ꯭༭꯭ 𝐁꯭ᴀ꯭ɴ

❖ 𝐂꯭ʀ꯭ᴇ꯭ᴅ꯭ɪ꯭ᴛ ꯭༭꯭ 𝖡ʏ » [𝐊꯭ɪ꯭ʀ꯭ᴛ꯭ɪ-𝐁꯭ᴏ꯭ᴛ꯭ѕ](https://t.me/kirti_bots)**
'''


# ===========================================================
# ©️ 2025-26 All Rights Reserved by Purvi Bots (Im-Notcoder) 😎
#
# 🧑‍💻 Developer : t.me/TheSigmaCoder
# 🔗 Source link : GitHub.com/Im-Notcoder/Shivi-V2
# 📢 Telegram channel : t.me/Purvi_Bots
# ===========================================================
